In [2]:
import pandas as pd
import numpy as np

In [3]:
data = pd.Series(np.random.randn(9),
                index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])

In [4]:
data

a  1   -0.216035
   2    0.553311
   3    0.281082
b  1   -2.353510
   3   -1.599825
c  1   -1.312342
   2   -1.584313
d  2   -0.706101
   3    1.878731
dtype: float64

In [6]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [7]:
data['b']

1   -2.353510
3   -1.599825
dtype: float64

In [8]:
data['b':'c']

b  1   -2.353510
   3   -1.599825
c  1   -1.312342
   2   -1.584313
dtype: float64

In [10]:
data.loc[:,2]

a    0.553311
c   -1.584313
d   -0.706101
dtype: float64

In [11]:
data.unstack()

          1         2         3
a -0.216035  0.553311  0.281082
b -2.353510       NaN -1.599825
c -1.312342 -1.584313       NaN
d       NaN -0.706101  1.878731

In [12]:
data.unstack().stack()

a  1   -0.216035
   2    0.553311
   3    0.281082
b  1   -2.353510
   3   -1.599825
c  1   -1.312342
   2   -1.584313
d  2   -0.706101
   3    1.878731
dtype: float64

In [14]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)),
                    index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'],
                              ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [15]:
frame.index.names = ['key1','key2']

In [16]:
frame.columns.names = ['state','color']

In [17]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [18]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10